**free
ctl-opt dftactgrp(*no) actgrp(*new);

// Pretend: load all invoices into a work structure or temp file
dsply 'Loading All Invoices...';

*inlr = *on;
return;
